/* Localizable strings */

accessDeniedFmt = "Access denied to database from domain %@";
allow = "Allow";

capabilitiesPromptFmt = "The website %@ wants to use %@'s offline features. Would you like to allow this?";

databaseHandleNULL = "Database handle was NULL";
databaseNotOpen = "Database not open";
databaseAlreadyOpen = "Database already open";
databaseOperationFailed = "Database operation failed.";
datatypeNotSupportedFmt = "Datatype %d not supported";
deny = "Deny";

errorInBindingFmt = "Error binding arguments to query: Expecting %d argument(s), got %d";
errorInFinalizeFmt = "SQLite finalize() failed (%d)";
errorInPreparingQuery = "SQLite prepare() failed.";
expired = "This product has expired.";

invalidDomainAccessFromPageFmt = "Cannot open domain %@ from page on %@";
invalidDomainAccess = "Url is not from the same origin";
invalidFieldNameFmt = "Invalid field name: %@";
invalidModuleNameFmt = "Invalid module name: %@";
invalidNameFmt = "Invalid name: %@";
invalidParameter = "Invalid parameter";
invalidVersionFmt = "Invalid Version: %@"; 

permissionDenied = "Page does not have permission to use Gears";

rememberDecision = "Remember my decision for this site";
requiredArrayArgument = "Required array argument";

unableToCopyFmt = "Unable to copy %@ to %@"; 
unableToCreateClassVersionFmt = "Unable to create class %@ (version: %@)";
unableToCreateComponentFmt = "Unable to create component %@ (version: %@)";
unableToInitializeCapture = "Unable to initialize the capture task";
unableToInitializeManagedResourceStore = "Unable to initialize ManagedResourceStore";
unableToInitializeResourceStore = "Unable to initialize ResourceStore";
unableToInitializeUpdate = "Unable to initialize the update task";
unableToOpenDB = "Couldn't open SQLite database";
unableToRemoveStoreFmt = "Unable to remove store %@ (cookie: %@)";
unableToRenameFmt = "Unable to rename %@ to %@";
unableToStartCapture = "Unable to start the capture task";
unableToStartUpdate = "Unable to start the update task";
unableToGetManifest = "Failed to get manifest url";
unableToSetManifest = "Failed to set manifest url";